In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

## Удаление столбцов и строк. Отсутствующие значения.

In [2]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, np.nan]})
df

   A  B    C
0  1  4  7.0
1  2  5  8.0
2  3  6  NaN

Проверка на NaN-ы:

In [3]:
df.isna()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False   True

In [4]:
df.isna().sum()

A    0
B    0
C    1
dtype: int64

Удалять строки и столбцы с пустыми значениями можно с помощию функции `dropna`. Обратите внимание, что применение функции без присваивания создает новый объект, а не меняет *df*.

In [5]:
df.dropna()

   A  B    C
0  1  4  7.0
1  2  5  8.0

Как и у многих других функций библиотек `numpy` и `pandas` есть аргумент `axis`, который отвечает за выбор: просмотр строк или просмотр столбцов:

In [6]:
df.dropna(axis = 0)

   A  B    C
0  1  4  7.0
1  2  5  8.0

In [7]:
df.dropna(axis = 1)

   A  B
0  1  4
1  2  5
2  3  6

Пропущенные значения можно не только удалить, но и заполнить:

In [8]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

Заполнить можно значением:

In [9]:
df.fillna(value=0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

Словарем значений:

In [10]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [11]:
values = {"A": 0, "B": 1, "C": 2, "D": 3}
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

Методом заполнения вперед:

In [12]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [13]:
df.fillna(method="ffill")

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  4.0 NaN  1.0
3  3.0  3.0 NaN  4.0

Методом заполенения назад:

In [14]:
df.fillna(method="bfill")

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  3.0 NaN  4.0
3  NaN  3.0 NaN  4.0

И, конечно, нужно уметь удалять ненужные столбцы. Для этого есть функция `drop`. Здесь мы уже не обращаем внимание на наличие или отсутствие пустых значений. Параметрами подаются список названий колонок для удаления, и часто указывается `axis=1`, т.к. по умолчанию считается axis=0, в этом случае поиск будет по индексам строк.

In [15]:
df.drop(["C"], axis = 1)

     A    B    D
0  NaN  2.0  0.0
1  3.0  4.0  1.0
2  NaN  NaN  NaN
3  NaN  3.0  4.0

In [16]:
df.fillna(method="bfill").drop(["A", "C"], axis = 1)

     B    D
0  2.0  0.0
1  4.0  1.0
2  3.0  4.0
3  3.0  4.0

Функция `drop` также не изменяет исходный объект, а создает новый. Для изменения исходного объекта нужно присвоить ему этот результат:

In [17]:
df = df.fillna(method="bfill").drop(["A", "C"], axis = 1)

In [18]:
df

     B    D
0  2.0  0.0
1  4.0  1.0
2  3.0  4.0
3  3.0  4.0

Еще пара способов:

In [19]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                columns=list("ABCD"))
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [20]:
df.mean()

A    3.000000
B    3.000000
C         NaN
D    1.666667
dtype: float64

pd.help(fillna)

In [21]:
df.fillna(df.mean())

     A    B   C         D
0  3.0  2.0 NaN  0.000000
1  3.0  4.0 NaN  1.000000
2  3.0  3.0 NaN  1.666667
3  3.0  3.0 NaN  4.000000

In [22]:
df.min().fillna(df.max().min())

A    3.0
B    2.0
C    3.0
D    0.0
dtype: float64

In [25]:
print(df)
print(df.fillna(df.min()))
df.fillna(df.min()).fillna(df.max().min())

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0
     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  2.0 NaN  0.0
3  3.0  3.0 NaN  4.0

     A    B    C    D
0  3.0  2.0  3.0  0.0
1  3.0  4.0  3.0  1.0
2  3.0  2.0  3.0  0.0
3  3.0  3.0  3.0  4.0

**Упражнение 1.** Объясните, как работает ячейка выше.

df.max().min() - наименьший из максимумов в каждом столбце, запуская fillna от этого результата к df.min() мы поменяем минимумы nan на это число, получим таблицу из одного столбца. Далее df.fillna заполнит все nan в соответствии со значением таблицы к конкретному столбцу

**Упражнение 2.** Дан датафрейм в ячейке ниже, состоящий из 4 единиц на диагонали и nan-ов. Заполнить его так, чтобы в нем было 8 единиц и 8 двоек. Использовать только `fillna`.

In [7]:
df = pd.DataFrame([[1, np.nan, np.nan, np.nan],
                   [np.nan, 1, np.nan, np.nan],
                   [np.nan, np.nan, 1, np.nan],
                   [np.nan, np.nan, np.nan, 1]],
                columns=list("ABCD"))
df

     A    B    C    D
0  1.0  NaN  NaN  NaN
1  NaN  1.0  NaN  NaN
2  NaN  NaN  1.0  NaN
3  NaN  NaN  NaN  1.0

In [8]:
df[['A', 'C']] = df[['A', 'C']].fillna(method='ffill')
df = df.fillna(2)
df

     A    B    C    D
0  1.0  2.0  2.0  2.0
1  1.0  1.0  2.0  2.0
2  1.0  2.0  1.0  2.0
3  1.0  2.0  1.0  1.0

**Упражнение 3.** Из полученного датафрейма удалить столбец (или столбцы) с минимальной суммой значений.

import copy
df1 = copy.deepcopy(df)

for i in df.iterrows():
    print(i)

df = copy.deepcopy(df1)
for n, rou in df.iterrows():
    for i, c in rou.iteritems():
        if c == 1:
            df.loc[n, i] = -1
    print(rou)
df

In [9]:
import copy df1 = copy.deepcopy(df)

for i in df.iterrows(): print(i)

df = copy.deepcopy(df1) for n, rou in df.iterrows(): for i, c in rou.iteritems(): if c == 1: df.loc[n, i] = -1 print(rou) df
df = copy.deepcopy(df1)
df

SyntaxError: invalid syntax (1419654480.py, line 1)

In [10]:
print(df.sum().sort_values().index[0])
df.drop(columns=df.sum().sort_values().index[0])

A

     B    C    D
0  2.0  2.0  2.0
1  1.0  2.0  2.0
2  2.0  1.0  2.0
3  2.0  1.0  1.0

## Еще работа с данными. Пассажиры Титаника.

In [19]:
df = pd.read_csv('train.csv')

In [35]:
df.head(100)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0000,NaN,S
99,100,0,2,"Kantor, Mr. Sinai",male,34.0,1,0,244367,26.0000,NaN,S

In [103]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [104]:
df.shape

(891, 12)

**Упражнение 4.** Найдите средний возраст пассажиров

In [103]:
df[['Age']].mean()

Age    29.699118
dtype: float64

**Упражнение 5.** Выведите имя самого молодого пассажира.

In [13]:
df['Name'][df['Age'].argmin()]

803    Thomas, Master. Assad Alexander
Name: Name, dtype: object

**Упражнение 6.** Посчитайте доли пассажиров по классам обслуживания (Pclass)

In [33]:
s = int(df.shape[0])
print('I class', str(int(int(df[df.Pclass == 1].shape[0])/s*10000)/100)+'%')
print('II class', str(int(int(df[df.Pclass == 2].shape[0])/s*10000)/100)+'%')
print('III class', str(int(int(df[df.Pclass == 3].shape[0])/s*10000)/100)+'%')

I class 24.24%
II class 20.65%
III class 55.1%

**Упражнение 7.** Найдите средние возраста пассажиров по классам обслуживания.

In [34]:
df[["Pclass", "Age"]].groupby(["Pclass"]).mean()

              Age
Pclass
1       38.233441
2       29.877630
3       25.140620

**Упражнение 8.** Удалите столбец с наибольшим числом пропусков.

In [45]:
df = df.drop(columns=[df.isna().sum().idxmax()])
df

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500,S
889,890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000,C
890,891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500,Q

**Упражнение 9.** Удалите столбцы с наибольшим числом уникальных значений.

In [60]:
df = pd.read_csv('train.csv')
m = df.nunique().max()
while df.nunique().max() == m:
    df = df.drop(columns=[df.nunique().idxmax()])
df

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,female,19.0,0,0,112053,30.0000,B42,S
888,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,male,26.0,0,0,111369,30.0000,C148,C
890,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

**Упражнение 10.** Найдите доли выживших среди мужчин, среди женщин и среди всех пассажиров.

In [78]:
df = pd.read_csv('train.csv')
g = df[['Sex', 'Survived']].groupby(['Sex']).sum()
g.iloc[0, 0] = str(int(g.iloc[0, 0]/int(df[df['Sex']== 'female'].shape[0])*10000)/100)+'%'
g.iloc[1, 0] = str(int(g.iloc[1, 0]/int(df[df['Sex']== 'male'].shape[0])*10000)/100)+'%'
g

       Survived
Sex
female    74.2%
male     18.89%

**Упражнение 11.** Найдите доли выживших по классам обслуживания.

In [82]:
df = pd.read_csv('train.csv')
g = df[['Pclass', 'Survived']].groupby(['Pclass']).sum()
g.iloc[0, 0] = str(int(g.iloc[0, 0]/int(df[df['Pclass']== 1].shape[0])*10000)/100)+'%'
g.iloc[1, 0] = str(int(g.iloc[1, 0]/int(df[df['Pclass']== 2].shape[0])*10000)/100)+'%'
g.iloc[2, 0] = str(int(g.iloc[2, 0]/int(df[df['Pclass']== 3].shape[0])*10000)/100)+'%'
g

       Survived
Pclass
1        62.96%
2        47.28%
3        24.23%

**Упражнение 12.** Найдите доли выживших среди возрастных категорий 18-, 18-60, 60+.

In [1]:
df = pd.read_csv('train.csv')
g = df[['Age', 'Survived']]
g1 = g[g['Age'] < 18]
print('Выжило 18-:', str(int(g1[g1['Survived'] == 1].sum()[1]/g1.shape[0]*10000)/100)+'%')
g2 = g[(g['Age'] >= 18) & (g['Age'] < 60)]
print('Выжило 18-60:', str(int(g2[g2['Survived'] == 1].sum()[1]/g2.shape[0]*10000)/100)+'%')
g3 = g[g['Age'] >= 60]
print('Выжило 60+:', str(int(g2[g2['Survived'] == 1].sum()[1]/g2.shape[0]*10000)/100)+'%')

NameError: name 'pd' is not defined